_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_12 (Conv2D)           (None, 26, 82, 6)         60        
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 24, 80, 6)         330       
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 22, 78, 6)         330       
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 11, 39, 6)         0         
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 9, 37, 16)         880       
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 7, 35, 16)         2320      
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 5, 33, 16)         2320      
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 2, 16, 16)         0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 512)               0         
_________________________________________________________________
dense_6 (Dense)              (None, 120)               61560     
_________________________________________________________________
dense_7 (Dense)              (None, 84)                10164     
_________________________________________________________________
dense_8 (Dense)              (None, 256)               21760     
=================================================================
Total params: 99,724
Trainable params: 99,724
Non-trainable params: 0
_________________________________________________________________
