{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.6-tf", "config": {"name": "sequential", "layers": [{"class_name": "Conv2D", "config": {"padding": "same", "dilation_rate": [1, 1], "filters": 6, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "batch_input_shape": [null, 28, 84, 1], "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "relu", "name": "conv2d", "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true}}, {"class_name": "Conv2D", "config": {"padding": "same", "dilation_rate": [1, 1], "filters": 6, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "relu", "name": "conv2d_1", "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "padding": "valid", "data_format": "channels_last", "dtype": "float32", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"padding": "same", "dilation_rate": [1, 1], "filters": 16, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "relu", "name": "conv2d_2", "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true}}, {"class_name": "Conv2D", "config": {"padding": "same", "dilation_rate": [1, 1], "filters": 16, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "relu", "name": "conv2d_3", "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "padding": "valid", "data_format": "channels_last", "dtype": "float32", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"padding": "same", "dilation_rate": [1, 1], "filters": 32, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "relu", "name": "conv2d_4", "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true}}, {"class_name": "Conv2D", "config": {"padding": "same", "dilation_rate": [1, 1], "filters": 32, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "relu", "name": "conv2d_5", "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true}}, {"class_name": "Conv2D", "config": {"padding": "same", "dilation_rate": [1, 1], "filters": 32, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "relu", "name": "conv2d_6", "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "padding": "valid", "data_format": "channels_last", "dtype": "float32", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"padding": "same", "dilation_rate": [1, 1], "filters": 32, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "relu", "name": "conv2d_7", "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true}}, {"class_name": "Conv2D", "config": {"padding": "same", "dilation_rate": [1, 1], "filters": 32, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "relu", "name": "conv2d_8", "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true}}, {"class_name": "Conv2D", "config": {"padding": "same", "dilation_rate": [1, 1], "filters": 32, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "relu", "name": "conv2d_9", "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "padding": "valid", "data_format": "channels_last", "dtype": "float32", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten", "dtype": "float32", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null, "units": 512, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "relu", "name": "dense", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null, "units": 512, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "relu", "name": "dense_1", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null, "units": 256, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "softmax", "name": "dense_2", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true}}]}}