_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 28, 84, 6)         60        
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 28, 84, 6)         330       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 14, 42, 6)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 14, 42, 16)        880       
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 14, 42, 16)        2320      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 7, 21, 16)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 7, 21, 32)         4640      
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 7, 21, 32)         9248      
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 7, 21, 32)         9248      
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 3, 10, 32)         0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 3, 10, 32)         9248      
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 3, 10, 32)         9248      
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 3, 10, 32)         9248      
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 1, 5, 32)          0         
_________________________________________________________________
flatten (Flatten)            (None, 160)               0         
_________________________________________________________________
dense (Dense)                (None, 512)               82432     
_________________________________________________________________
dense_1 (Dense)              (None, 512)               262656    
_________________________________________________________________
dense_2 (Dense)              (None, 256)               131328    
=================================================================
Total params: 530,886
Trainable params: 530,886
Non-trainable params: 0
_________________________________________________________________
