_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_67 (Conv2D)           (None, 28, 84, 32)        320
_________________________________________________________________
conv2d_68 (Conv2D)           (None, 28, 84, 32)        9248
_________________________________________________________________
max_pooling2d_27 (MaxPooling (None, 14, 42, 32)        0
_________________________________________________________________
conv2d_69 (Conv2D)           (None, 14, 42, 64)        18496
_________________________________________________________________
conv2d_70 (Conv2D)           (None, 14, 42, 64)        36928
_________________________________________________________________
max_pooling2d_28 (MaxPooling (None, 7, 21, 64)         0
_________________________________________________________________
conv2d_71 (Conv2D)           (None, 7, 21, 128)        73856
_________________________________________________________________
conv2d_72 (Conv2D)           (None, 7, 21, 128)        147584
_________________________________________________________________
conv2d_73 (Conv2D)           (None, 7, 21, 128)        147584
_________________________________________________________________
max_pooling2d_29 (MaxPooling (None, 3, 10, 128)        0
_________________________________________________________________
conv2d_74 (Conv2D)           (None, 3, 10, 128)        147584
_________________________________________________________________
conv2d_75 (Conv2D)           (None, 3, 10, 128)        147584
_________________________________________________________________
conv2d_76 (Conv2D)           (None, 3, 10, 128)        147584
_________________________________________________________________
max_pooling2d_30 (MaxPooling (None, 1, 5, 128)         0
_________________________________________________________________
flatten_7 (Flatten)          (None, 640)               0
_________________________________________________________________
dense_21 (Dense)             (None, 512)               328192
_________________________________________________________________
dense_22 (Dense)             (None, 512)               262656
_________________________________________________________________
dense_23 (Dense)             (None, 256)               131328
=================================================================
Total params: 1,598,944
Trainable params: 1,598,944
Non-trainable params: 0
_________________________________________________________________
