{"backend": "tensorflow", "class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Conv2D", "config": {"name": "conv2d", "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "activation": "relu", "activity_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "dtype": "float32", "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_size": [5, 5], "filters": 6}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "padding": "valid", "trainable": true, "pool_size": [2, 2], "dtype": "float32", "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "activation": "relu", "activity_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "dtype": "float32", "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_size": [5, 5], "filters": 16}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "padding": "valid", "trainable": true, "pool_size": [2, 2], "dtype": "float32", "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "data_format": "channels_last", "dtype": "float32"}}, {"class_name": "Dense", "config": {"name": "dense", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 120, "activation": "relu", "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "dtype": "float32", "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 84, "activation": "relu", "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "dtype": "float32", "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 256, "activation": "softmax", "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "dtype": "float32", "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null}}]}, "keras_version": "2.1.6-tf"}