_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 24, 80, 6)         156       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 12, 40, 6)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 8, 36, 16)         2416      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 4, 18, 16)         0         
_________________________________________________________________
flatten (Flatten)            (None, 1152)              0         
_________________________________________________________________
dense (Dense)                (None, 120)               138360    
_________________________________________________________________
dense_1 (Dense)              (None, 84)                10164     
_________________________________________________________________
dense_2 (Dense)              (None, 256)               21760     
=================================================================
Total params: 172,856
Trainable params: 172,856
Non-trainable params: 0
_________________________________________________________________
